{
  "title": "RPMTALKS",
  "siteUrl": "https://www.rpmtalks.com",
  "description": "We are a team of automobile enthusiasts that share the raging passion for automobiles and are here to take you on a road trip into the incredible world of automobiles. \nWe at RPMTALKS would be indulging you with the;\nlatest news from around the world, turbocharged entertainment, extravagant and exclusive interviews with leaders in the\nautomobile world, supercar montages and exclusive coverage from the city of Nashik. \n\nBuckle yourself in for an epic ride through the world of\nautomobiles with us and hope you enjoy the journey!\n\nRPMTalks is Nashik's leading Automotive Media Agency founded by Arnav Kulkarni and Vedant Suryawanshi in 2020.\nCurrently based in Nashik, RPMTalks is already underway on expanding to cities like Surat, Pune, Bombay and has plans to expand further! \n\nIf you have any car related news, a wish to join us, any contributions/ suggestions, \nOr if you would like to feature yourself or someone you know. \nplease feel free to Contact us at - rpmtalks@gmail.com",
  "home": {
    "title": "RPMTALKS",
    "description": "We are a team of automobile enthusiasts that share the raging passion for automobiles and are here to take you on a road trip into the incredible world of automobiles.  We at RPMTALKS would be indulging you with the; latest news from around the world, turbocharged entertainment, extravagant and exclusive interviews with leaders in the automobile world, supercar montages and exclusive coverage from the city of Nashik. \\\n---\\\nBuckle yourself in for an epic ride through the world of automobiles with us and hope you enjoy the journey!\\\n---\\\nRPMTalks is Nashik's leading Automotive Media Agency founded by Arnav Kulkarni and Vedant Suryawanshi in 2020. Currently based in Nashik, RPMTalks is already underway on expanding to cities like Surat, Pune, Bombay and has plans to expand further! \\\n---\\\nIf you have any car related news, a wish to join us, any contributions/ suggestions,  Or if you would like to feature yourself or someone you know, please feel free to e-mail us at - rpmtalks@gmail.com"
  }
}